MCUdude/MiniCore/avr/boards.txt
8.menu.clock.14_7456MHz_external=External 14.7456 MHz
8.menu.clock.14_7456MHz_external.upload.speed=115200
8.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
8.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

8.menu.clock.12MHz_external=External 12 MHz
8.menu.clock.12MHz_external.upload.speed=57600
8.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.12MHz_external.bootloader.ckopt_bit=0
8.menu.clock.12MHz_external.build.f_cpu=12000000L

8.menu.clock.11_0592MHz_external=External 11.0592 MHz
8.menu.clock.11_0592MHz_external.upload.speed=115200
8.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
8.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

8.menu.clock.8MHz_external=External 8 MHz
8.menu.clock.8MHz_external.upload.speed=57600
8.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.8MHz_external.bootloader.ckopt_bit=0
8.menu.clock.8MHz_external.build.f_cpu=8000000L

8.menu.clock.7_3728MHz_external=External 7.3728 MHz
8.menu.clock.7_3728MHz_external.upload.speed=115200
8.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
8.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

8.menu.clock.3_6864MHz_external=External 3.6864 MHz
8.menu.clock.3_6864MHz_external.upload.speed=115200
8.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
8.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

8.menu.clock.1_8432MHz_external=External 1.8432 MHz
8.menu.clock.1_8432MHz_external.upload.speed=115200
8.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
8.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

8.menu.clock.8MHz_internal=Internal 8 MHz
8.menu.clock.8MHz_internal.upload.speed=38400
8.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
8.menu.clock.8MHz_internal.build.f_cpu=8000000L

8.menu.clock.1MHz_internal=Internal 1 MHz
8.menu.clock.1MHz_internal.upload.speed=9600
8.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
8.menu.clock.1MHz_internal.build.f_cpu=1000000L
